{"Employee Relation_DBS Mintek ": {"1": "Describe a time you had to navigate a complex employee conflict involving differing cultural norms or communication styles, and what steps did you take to reach a resolution aligned with DBS's inclusive culture principles?", "2": "DBS Mintek is a fast-paced and innovative environment. Can you describe a time you had to navigate a complex employee relations issue in a rapidly changing or ambiguous situation, and what approach did you take to ensure a fair and consistent outcome while minimizing disruption?", "3": "Describe a time you had to navigate a complex employee conflict involving differing cultural backgrounds or communication styles. What steps did you take to mediate the situation and what was the outcome?", "4": "DBS Mintek values a proactive and empathetic approach to employee concerns. Describe a time you successfully mediated a conflict between two employees, highlighting the steps you took to understand their perspectives and reach a mutually agreeable solution.", "5": "How would you approach mediating a dispute between an employee and their manager, specifically concerning performance expectations at DBS Mintek, keeping in mind our company's focus on innovation and rapid development cycles?"}, "developer_google": {"1": "Given Google's focus on large-scale data processing and distributed systems, describe a situation where you had to optimize a slow or inefficient algorithm, and what techniques you used to achieve significant performance improvements. Please quantify the improvements you achieved.", "2": "Given a very large stream of website click data, how would you efficiently identify the top K most frequently visited URLs in real-time? Consider the trade-offs between accuracy, memory usage, and processing speed.", "3": "Given Google's emphasis on large-scale data processing, how would you approach designing a system to efficiently count the frequency of words in a very large text corpus (e.g., terabytes) using a distributed computing framework like MapReduce?", "4": "Given Google's focus on large-scale data processing, describe a time you had to optimize a data pipeline for performance or cost efficiency. What were the key bottlenecks, and what strategies did you employ to address them?", "5": "Given Google's focus on large-scale data processing and machine learning, describe a time you had to optimize a data pipeline or algorithm for performance or scalability. What were the bottlenecks, and what strategies did you use to overcome them?"}, "ui designer_pinterest": {"1": "Pinterest is a visual discovery platform. Tell me about a time you designed a UI for a feature that heavily relied on visual content and how you ensured it was both engaging and easy to navigate?", "2": "Pinterest relies heavily on visual storytelling. Can you describe a time you used visual design to communicate a complex idea or process, and what impact did that have?", "3": "Pinterest is a visual discovery platform. How would you approach designing a new feature that helps users discover and organize ideas for a specific life event, like planning a wedding or renovating a home?", "4": "Pinterest is all about visual discovery. How would you approach designing a new feature that helps users visually compare similar products or ideas from different sources on our platform?"}, "ui designer_google": {"1": "Describe a time you had to advocate for a specific UI design decision, and how you convinced stakeholders with differing opinions at Google?", "2": "Describe a time you had to advocate for the user in a design decision where stakeholders had conflicting priorities. How did you balance user needs with business goals, and what was the outcome?", "3": "How would you approach designing a new feature for Google Maps that allows users to collaboratively plan a road trip with multiple destinations, accounting for real-time traffic, suggested stops, and varying user preferences?", "4": "Describe a time you had to advocate for a user-centered design approach within a team where other priorities (e.g., technical feasibility, business goals) seemed to take precedence. How did you influence the decision-making process and what was the outcome?", "5": "Considering Google's Material Design system, describe a time you had to adapt or extend a component beyond its original specification to meet a unique user need. What challenges did you face, and how did you ensure consistency with the overall design language?"}}